src_ext/DataProcessors/УЗ_Календарь.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<DataProcessor>
		<Properties>
			<Name>УЗ_Календарь</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src_ext/InformationRegisters/УЗ_Оповещения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>УЗ_Оповещения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СрокНапоминания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УЗ_ДополнительныеРасходы</v8:Type>
						<v8:Type>cfg:DocumentRef.УЗ_СписаниеОстатков</v8:Type>
						<v8:Type>cfg:DocumentRef.УЗ_РасходДенег</v8:Type>
						<v8:Type>cfg:CatalogRef.УЗ_Тарифы</v8:Type>
						<v8:Type>cfg:CatalogRef.УЗ_ГруппыОбучения</v8:Type>
						<v8:Type>cfg:DocumentRef.УЗ_НачисленияПедагогам</v8:Type>
						<v8:Type>cfg:CatalogRef.УЗ_ДисконтныеКарты</v8:Type>
						<v8:Type>cfg:DocumentRef.УЗ_ПриходДенег</v8:Type>
						<v8:Type>cfg:CatalogRef.УЗ_ПредметыОбучения</v8:Type>
						<v8:Type>cfg:DocumentRef.УЗ_ГрафикРабочегоВремениПедагога</v8:Type>
						<v8:Type>cfg:DocumentRef.УЗ_Урок</v8:Type>
						<v8:Type>cfg:DocumentRef.УЗ_НачислениеБонусов</v8:Type>
						<v8:Type>cfg:CatalogRef.УЗ_Абонемент</v8:Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
						<v8:Type>cfg:DocumentRef.УЗ_ПеремещениеДенег</v8:Type>
						<v8:Type>cfg:CatalogRef.УЗ_Скидки</v8:Type>
						<v8:Type>cfg:CatalogRef.УЗ_Помещения</v8:Type>
						<v8:Type>cfg:CatalogRef.УЗ_СтавкиПедагогов</v8:Type>
						<v8:Type>cfg:DocumentRef.УЗ_РасчетЗарплаты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВремяСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Завершено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src_ext/Documents/УЗ_Урок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>УЗ_Урок</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УЗ_СписанияСуммЗаУроки</xr:Item>
				<xr:Item>AccumulationRegister.УЗ_Расходы</xr:Item>
				<xr:Item>AccumulationRegister.УЗ_РасчетыПоЗарплате</xr:Item>
				<xr:Item>AccumulationRegister.УЗ_ДвижениеДисконтныхКарт</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредметОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ПредметыОбучения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ГруппыОбучения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснования</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УЗ_ДополнительныеРасходы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Окончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Педагог</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Помещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Статусы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Тарифы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаПедагога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_СтавкиПедагогов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаСкидки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаБонусов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДопРасходов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачисленоПедагогу</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДомашнееЗадание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТемаУрока</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Ученики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СписатьОплату</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Явка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ученик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Абонемент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_Абонемент</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тариф</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_Тарифы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаТарифа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заметка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Причина</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Скидка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_Скидки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДисконтнаяКарта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_ДисконтныеКарты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБонусов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НачисленияПедагогу</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНачисления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеИзменять</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Расходы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтатьяЗатрат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_СтатьиДвиженияДенег</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src_ext/DataProcessors/УЗ_Календарь/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

//Данные календаря за период — ОДИН пакетный запрос: уроки с подписями и цветами, ученики уроков, помещения
//(измерение планировщика), график педагога, напоминания и дни с уроками (жирные даты календаря). Раньше форма
//читала каждый урок, его группу, предмет, педагога, учеников и помещение через точку в цикле (сотни чтений объектов
//на неделю) и собирала отборы СтрЗаменить по тексту запроса. Возврат — простые значения: форма строит планировщик,
//замер нагрузки (tools\нагрузка\замеры.py) вызывает ту же функцию через COM.
//
//Отборы — Структура(Педагог, Помещение, ГруппаОбучения, Ученик, Статус): пустое значение — без отбора.
//Показ — Структура(ГруппаОбучения, ПредметОбучения, Педагог, Ученики — флажки подписи; Цвет — «Помещение»,
//«ПредмОбуч», «Педагог»; Помещения — измерение по помещениям; ВсеПомещения; Напоминания).
//ДатаЗанятых — дата календаря-навигатора: дни с уроками за месяц до и после неё; Неопределено — не нужны.
//Возврат — Структура:
//Уроки — Массив Структур(Ссылка, Начало, Конец, Текст, ТекстНедели — «время» и предмет для
//режима «неделя», Проведен, Помещение, Педагог, Цвет — имя веб-цвета);
//  Помещения — Массив Структур(Помещение, Текст, Цвет); ИнтервалыГрафика — Массив Структур(Начало, Конец);
//  Напоминания — Массив Структур(Начало, Текст, Ключ — структура ключа записи УЗ_Оповещения);
//  ЗанятыеДаты — Массив дат (начало дня) или Неопределено.
Функция ДанныеКалендаря(ДатаНачала, ДатаОкончания, Отборы, Показ, ДатаЗанятых = Неопределено) Экспорт

	Запрос = Новый Запрос(ТекстЗапросаКалендаря());
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	УстановитьОтбор(Запрос, "Педагог", Отборы, Справочники.УЗ_ФизЛица.ПустаяСсылка());
	УстановитьОтбор(Запрос, "Помещение", Отборы, Справочники.УЗ_Помещения.ПустаяСсылка());
	УстановитьОтбор(Запрос, "ГруппаОбучения", Отборы, Справочники.УЗ_ГруппыОбучения.ПустаяСсылка());
	УстановитьОтбор(Запрос, "Ученик", Отборы, Справочники.УЗ_ФизЛица.ПустаяСсылка());
	УстановитьОтбор(Запрос, "Статус", Отборы, Справочники.УЗ_Статусы.ПустаяСсылка());
	Запрос.УстановитьПараметр("СУчениками", ЗначениеПоказа(Показ, "Ученики", Ложь));
	Запрос.УстановитьПараметр("СПомещениями", ЗначениеПоказа(Показ, "Помещения", Ложь));
	Запрос.УстановитьПараметр("ВсеПомещения", ЗначениеПоказа(Показ, "ВсеПомещения", Ложь));
	Запрос.УстановитьПараметр("СГрафиком", Не Запрос.Параметры.БезПедагог);
	Запрос.УстановитьПараметр("НачалоГрафика", НачалоМесяца(ДатаНачала));
	Запрос.УстановитьПараметр("КонецГрафика", КонецМесяца(ДатаОкончания));
	Запрос.УстановитьПараметр("СНапоминаниями", ЗначениеПоказа(Показ, "Напоминания", Ложь));
	Адресаты = Новый Массив;
	Адресаты.Добавить(Справочники.Пользователи.ПустаяСсылка());
	ТекущийПользователь = УЗ_Среда.ТекущийПользователь();
	Если ЗначениеЗаполнено(ТекущийПользователь) Тогда
		Адресаты.Добавить(ТекущийПользователь);
	КонецЕсли;
	Запрос.УстановитьПараметр("Адресаты", Адресаты);
	Запрос.УстановитьПараметр("СЗанятыми", ДатаЗанятых <> Неопределено);
	ДатаМесяца = ?(ДатаЗанятых = Неопределено, ДатаНачала, ДатаЗанятых);
	Запрос.УстановитьПараметр("НачалоЗанятых", НачалоМесяца(НачалоМесяца(ДатаМесяца) - 1));
	Запрос.УстановитьПараметр("КонецЗанятых", КонецМесяца(КонецМесяца(ДатаМесяца) + 1));

	Пакет = Запрос.ВыполнитьПакет();
	//0 — ВТ уроков, 1 — уроки, 2 — ученики, 3 — помещения, 4 — график, 5 — напоминания, 6 — занятые дни

	ИменаУчеников = Новый Соответствие; //Урок → Массив кратких ФИО
	Выборка = Пакет[2].Выбрать();
	Пока Выборка.Следующий() Цикл
		Имена = ИменаУчеников[Выборка.Ссылка];
		Если Имена = Неопределено Тогда
			Имена = Новый Массив;
			ИменаУчеников.Вставить(Выборка.Ссылка, Имена);
		КонецЕсли;
		Имена.Добавить(УЗ_ОбщийКлиентСервер.КраткоеФИО(Выборка.Имя));
	КонецЦикла;

	Цвет = ЗначениеПоказа(Показ, "Цвет", "");
	Уроки = Новый Массив;
	Выборка = Пакет[1].Выбрать();
	Пока Выборка.Следующий() Цикл
		//подпись — по строкам (группа, предмет, педагог «Фамилия И. О.», ученики), чтобы узкий прямоугольник
		//не переносил слова по слогам; ничего не выбрано — предмет (или группа) и педагог
		Части = Новый Массив;
		Если ЗначениеПоказа(Показ, "ГруппаОбучения", Ложь) И ЗначениеЗаполнено(Выборка.ИмяГруппы) Тогда
			Части.Добавить(Выборка.ИмяГруппы);
		КонецЕсли;
		Если ЗначениеПоказа(Показ, "ПредметОбучения", Ложь) И ЗначениеЗаполнено(Выборка.ИмяПредмета) Тогда
			Части.Добавить(Выборка.ИмяПредмета);
		КонецЕсли;
		Если ЗначениеПоказа(Показ, "Педагог", Ложь) И ЗначениеЗаполнено(Выборка.ИмяПедагога) Тогда
			Части.Добавить(УЗ_ОбщийКлиентСервер.КраткоеФИО(Выборка.ИмяПедагога));
		КонецЕсли;
		Имена = ИменаУчеников[Выборка.Ссылка];
		Если Имена <> Неопределено Тогда
			Части.Добавить(СтрСоединить(Имена, ", "));
		КонецЕсли;
		Если Части.Количество() = 0 Тогда
			Части.Добавить(?(ЗначениеЗаполнено(Выборка.ИмяПредмета), Выборка.ИмяПредмета,
				?(ЗначениеЗаполнено(Выборка.ИмяГруппы), Выборка.ИмяГруппы, НСтр("ru = 'Урок'"))));
			Если ЗначениеЗаполнено(Выборка.ИмяПедагога) Тогда
				Части.Добавить(УЗ_ОбщийКлиентСервер.КраткоеФИО(Выборка.ИмяПедагога));
			КонецЕсли;
		КонецЕсли;
		Текст = СтрСоединить(Части, Символы.ПС);
		//проведённый урок отличим: «✓» в начале подписи (рамку ставит форма)
		Если Выборка.Проведен Тогда
			Текст = "✓ " + Текст;
		КонецЕсли;

		ИмяЦвета = "";
		Если Цвет = "Помещение" Тогда
			ИмяЦвета = Выборка.ЦветПомещения;
		ИначеЕсли Цвет = "ПредмОбуч" Тогда
			ИмяЦвета = Выборка.ЦветПредмета;
		ИначеЕсли Цвет = "Педагог" Тогда
			ИмяЦвета = Выборка.ЦветПедагога;
		КонецЕсли;

		//короткая подпись для недели: «время» и «предмет» (нет предмета — группа) двумя строками, без педагога
		Название = ?(ЗначениеЗаполнено(Выборка.ИмяПредмета), Выборка.ИмяПредмета,
			?(ЗначениеЗаполнено(Выборка.ИмяГруппы), Выборка.ИмяГруппы, НСтр("ru = 'Урок'")));
		ТекстНедели = Формат(Выборка.Дата, "ДФ=HH:mm") + Символы.ПС + Название;
		Если Выборка.Проведен Тогда
			ТекстНедели = "✓ " + ТекстНедели;
		КонецЕсли;

		Урок = Новый Структура("Ссылка, Начало, Конец, Текст, ТекстНедели, Проведен, Помещение, Педагог, Цвет");
		Урок.ТекстНедели = ТекстНедели;
		Урок.Ссылка = Выборка.Ссылка;
		Урок.Начало = Выборка.Дата;
		Урок.Конец = Выборка.Дата + Окр(Выборка.КоличествоЧасов * 60) * 60; //В13: до минуты
		Урок.Текст = Текст;
		Урок.Проведен = Выборка.Проведен;
		Урок.Помещение = Выборка.Помещение;
		Урок.Педагог = Выборка.Педагог;
		Урок.Цвет = СокрЛП(ИмяЦвета);
		Уроки.Добавить(Урок);
	КонецЦикла;

	Помещения = Новый Массив;
	Выборка = Пакет[3].Выбрать();
	Пока Выборка.Следующий() Цикл
		Помещения.Добавить(Новый Структура("Помещение, Текст, Цвет", Выборка.Помещение,
			?(ЗначениеЗаполнено(Выборка.Помещение), Выборка.Имя, НСтр("ru = 'Без помещения'")), СокрЛП(Выборка.Цвет)));
	КонецЦикла;

	ИнтервалыГрафика = Новый Массив;
	Выборка = Пакет[4].Выбрать();
	Пока Выборка.Следующий() Цикл
		ИнтервалыГрафика.Добавить(Новый Структура("Начало, Конец",
			Выборка.Дата - ('00010101' - Выборка.ВремяНачала), Выборка.Дата - ('00010101' - Выборка.ВремяОкончания)));
	КонецЦикла;

	Напоминания = Новый Массив;
	Выборка = Пакет[5].Выбрать();
	Пока Выборка.Следующий() Цикл
		Ключ = Новый Структура("Источник, ВремяСобытия, Пользователь, Завершено, Организация",
			Выборка.Источник, Выборка.ВремяСобытия, Выборка.Пользователь, Выборка.Завершено, Выборка.Организация);
		Напоминания.Добавить(Новый Структура("Начало, Текст, Ключ", Выборка.СрокНапоминания,
			?(ПустаяСтрока(Выборка.Описание), Строка(Выборка.Источник), Выборка.Описание), Ключ));
	КонецЦикла;

	ЗанятыеДаты = Неопределено;
	Если ДатаЗанятых <> Неопределено Тогда
		ЗанятыеДаты = Пакет[6].Выгрузить().ВыгрузитьКолонку("Дата");
	КонецЕсли;

	Возврат Новый Структура("Уроки, Помещения, ИнтервалыГрафика, Напоминания, ЗанятыеДаты",
		Уроки, Помещения, ИнтервалыГрафика, Напоминания, ЗанятыеДаты);

КонецФункции

//Только дни с уроками (жирные даты календаря-навигатора) — при смене месяца навигатора.
Функция ЗанятыеДаты(ДатаЗанятых, Отборы) Экспорт

	Показ = Новый Структура;
	Данные = ДанныеКалендаря(ДатаЗанятых, ДатаЗанятых - 1, Отборы, Показ, ДатаЗанятых);
	Возврат Данные.ЗанятыеДаты;

КонецФункции

//Все тексты запросов модуля — для проверки по метаданным живой базы (tools\проверка_запросов.py, НайтиПараметры).
Функция ТекстЗапросаКалендаря() Экспорт

	Возврат
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Урок.Ссылка КАК Ссылка,
	|	Урок.Дата КАК Дата,
	|	Урок.КоличествоЧасов КАК КоличествоЧасов,
	|	Урок.Проведен КАК Проведен,
	|	Урок.Педагог КАК Педагог,
	|	Урок.Помещение КАК Помещение,
	|	Урок.ГруппаОбучения.Наименование КАК ИмяГруппы,
	|	Урок.ПредметОбучения.Наименование КАК ИмяПредмета,
	|	Урок.Педагог.Наименование КАК ИмяПедагога,
	|	Урок.Помещение.Наименование КАК ИмяПомещения,
	|	Урок.Помещение.Цвет КАК ЦветПомещения,
	|	Урок.ПредметОбучения.Цвет КАК ЦветПредмета,
	|	Урок.Педагог.Цвет КАК ЦветПедагога
	|ПОМЕСТИТЬ ВТ_Уроки
	|ИЗ
	|	Документ.УЗ_Урок КАК Урок
	|ГДЕ
	|	Урок.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И НЕ Урок.ПометкаУдаления
	|	И (&БезПедагог ИЛИ Урок.Педагог = &Педагог)
	|	И (&БезПомещение ИЛИ Урок.Помещение = &Помещение)
	|	И (&БезГруппаОбучения ИЛИ Урок.ГруппаОбучения = &ГруппаОбучения)
	|	И (&БезСтатус ИЛИ Урок.Статус = &Статус)
	|	И (&БезУченик
	|			ИЛИ Урок.Ссылка В
	|				(ВЫБРАТЬ
	|					УрокУченики.Ссылка
	|				ИЗ
	|					Документ.УЗ_Урок.Ученики КАК УрокУченики
	|				ГДЕ
	|					УрокУченики.Ученик = &Ученик))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Уроки.Ссылка КАК Ссылка,
	|	ВТ_Уроки.Дата КАК Дата,
	|	ВТ_Уроки.КоличествоЧасов КАК КоличествоЧасов,
	|	ВТ_Уроки.Проведен КАК Проведен,
	|	ВТ_Уроки.Педагог КАК Педагог,
	|	ВТ_Уроки.Помещение КАК Помещение,
	|	ВТ_Уроки.ИмяГруппы КАК ИмяГруппы,
	|	ВТ_Уроки.ИмяПредмета КАК ИмяПредмета,
	|	ВТ_Уроки.ИмяПедагога КАК ИмяПедагога,
	|	ВТ_Уроки.ЦветПомещения КАК ЦветПомещения,
	|	ВТ_Уроки.ЦветПредмета КАК ЦветПредмета,
	|	ВТ_Уроки.ЦветПедагога КАК ЦветПедагога
	|ИЗ
	|	ВТ_Уроки КАК ВТ_Уроки
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_Уроки.ИмяПомещения,
	|	ВТ_Уроки.ИмяПедагога,
	|	ВТ_Уроки.Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УрокУченики.Ссылка КАК Ссылка,
	|	УрокУченики.Ученик.Наименование КАК Имя
	|ИЗ
	|	Документ.УЗ_Урок.Ученики КАК УрокУченики
	|ГДЕ
	|	&СУчениками
	|	И УрокУченики.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТ_Уроки.Ссылка
	|			ИЗ
	|				ВТ_Уроки КАК ВТ_Уроки)
	|
	|УПОРЯДОЧИТЬ ПО
	|	УрокУченики.Ссылка,
	|	УрокУченики.НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Помещения.Помещение КАК Помещение,
	|	МАКСИМУМ(Помещения.Имя) КАК Имя,
	|	МАКСИМУМ(Помещения.Цвет) КАК Цвет
	|ИЗ
	|	(ВЫБРАТЬ
	|		Помещение.Ссылка КАК Помещение,
	|		Помещение.Наименование КАК Имя,
	|		ВЫРАЗИТЬ(Помещение.Цвет КАК СТРОКА(50)) КАК Цвет
	|	ИЗ
	|		Справочник.УЗ_Помещения КАК Помещение
	|	ГДЕ
	|		&СПомещениями
	|		И &ВсеПомещения
	|		И НЕ Помещение.ПометкаУдаления
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Урок.Помещение,
	|		Урок.Помещение.Наименование,
	|		ВЫРАЗИТЬ(Урок.Помещение.Цвет КАК СТРОКА(50))
	|	ИЗ
	|		Документ.УЗ_Урок КАК Урок
	|	ГДЕ
	|		&СПомещениями
	|		И (НЕ &ВсеПомещения
	|			ИЛИ Урок.Помещение = ЗНАЧЕНИЕ(Справочник.УЗ_Помещения.ПустаяСсылка))
	|		И Урок.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|		И НЕ Урок.ПометкаУдаления) КАК Помещения
	|
	|СГРУППИРОВАТЬ ПО
	|	Помещения.Помещение
	|
	|УПОРЯДОЧИТЬ ПО
	|	Имя
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ГрафикТЧ.Дата КАК Дата,
	|	ГрафикТЧ.ВремяНачала КАК ВремяНачала,
	|	ГрафикТЧ.ВремяОкончания КАК ВремяОкончания
	|ИЗ
	|	Документ.УЗ_ГрафикРабочегоВремениПедагога.ТЧ КАК ГрафикТЧ
	|ГДЕ
	|	&СГрафиком
	|	И ГрафикТЧ.Ссылка.Проведен
	|	И ГрафикТЧ.Ссылка.Педагог = &Педагог
	|	И ГрафикТЧ.Дата МЕЖДУ &НачалоГрафика И &КонецГрафика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Оповещения.Источник КАК Источник,
	|	Оповещения.ВремяСобытия КАК ВремяСобытия,
	|	Оповещения.Пользователь КАК Пользователь,
	|	Оповещения.Завершено КАК Завершено,
	|	Оповещения.СрокНапоминания КАК СрокНапоминания,
	|	Оповещения.Описание КАК Описание,
	|	Оповещения.Организация КАК Организация
	|ИЗ
	|	РегистрСведений.УЗ_Оповещения КАК Оповещения
	|ГДЕ
	|	&СНапоминаниями
	|	И НЕ Оповещения.Завершено
	|	И Оповещения.Пользователь В (&Адресаты)
	|	И Оповещения.СрокНапоминания МЕЖДУ &ДатаНачала И &ДатаОкончания
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	НАЧАЛОПЕРИОДА(Урок.Дата, ДЕНЬ) КАК Дата
	|ИЗ
	|	Документ.УЗ_Урок КАК Урок
	|ГДЕ
	|	&СЗанятыми
	|	И Урок.Дата МЕЖДУ &НачалоЗанятых И &КонецЗанятых
	|	И НЕ Урок.ПометкаУдаления
	|	И (&БезПедагог ИЛИ Урок.Педагог = &Педагог)
	|	И (&БезПомещение ИЛИ Урок.Помещение = &Помещение)
	|	И (&БезГруппаОбучения ИЛИ Урок.ГруппаОбучения = &ГруппаОбучения)";

КонецФункции

//Перенос урока в календаре (перетаскивание, растягивание, смена помещения) — что изменится, словами, для строки
//переноса на форме. Неопределено — ничего не меняется. Всё через один запрос к уроку, без чтения объекта.
Функция ОписаниеПереноса(Урок, Начало, Конец, ПомещениеКуда, СменаПомещения) Экспорт

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Урок.Дата КАК Дата,
	|	Урок.Окончание КАК Окончание,
	|	Урок.Помещение КАК Помещение,
	|	Урок.Номер КАК Номер,
	|	Урок.Проведен КАК Проведен
	|ИЗ
	|	Документ.УЗ_Урок КАК Урок
	|ГДЕ
	|	Урок.Ссылка = &Урок");
	Запрос.УстановитьПараметр("Урок", Урок);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда
		Возврат Неопределено;
	КонецЕсли;

	Помещение = ?(СменаПомещения, ПомещениеКуда, Выборка.Помещение);
	ДругоеВремя = Выборка.Дата <> Начало Или Выборка.Окончание <> Конец;
	ДругоеПомещение = Помещение <> Выборка.Помещение;
	Если Не ДругоеВремя И Не ДругоеПомещение Тогда
		Возврат Неопределено;
	КонецЕсли;

	Части = Новый Массив;
	Если ДругоеВремя Тогда
		Части.Добавить(СтрШаблон(НСтр("ru = '%1 → %2'"), ПредставлениеИнтервала(Выборка.Дата, Выборка.Окончание),
			ПредставлениеИнтервала(Начало, Конец)));
	КонецЕсли;
	Если ДругоеПомещение Тогда
		Части.Добавить(СтрШаблон(НСтр("ru = 'помещение «%1» → «%2»'"),
			?(ЗначениеЗаполнено(Выборка.Помещение), Выборка.Помещение, НСтр("ru = 'без помещения'")),
			?(ЗначениеЗаполнено(Помещение), Помещение, НСтр("ru = 'без помещения'"))));
	КонецЕсли;
	//A16-04: перенос проведённого урока на ещё не наступившее время отменяет его проведение (В10) — сказать до
	Если Выборка.Проведен И Начало > ТекущаяДатаСеанса() Тогда
		Части.Добавить(НСтр("ru = 'урок проведён — после переноса в будущее проведение будет отменено'"));
	КонецЕсли;
	Текст = СтрШаблон(НСтр("ru = 'Урок %1: %2'"), УЗ_ОбщийКлиентСервер.НомерНаПечать(Выборка.Номер),
		СтрСоединить(Части, "; "));

	Возврат Новый Структура("Урок, Дата, Окончание, Помещение, Текст", Урок, Начало, Конец, Помещение, Текст);

КонецФункции

//Применить перенос урока (ОписаниеПереноса): проведённый урок перепроводится, ещё не начавшийся — только
//записывается (В10, решение на сервере по ТекущаяДатаСеанса). Возврат — Структура(Успех, Текст).
Функция ПеренестиУрок(Перенос) Экспорт

	Объект = Перенос.Урок.ПолучитьОбъект();
	Объект.Дата = Перенос.Дата;
	Объект.КоличествоЧасов = (Перенос.Окончание - Перенос.Дата) / 3600;
	Объект.Помещение = Перенос.Помещение;
	Занято = Документы.УЗ_Урок.ТекстПересечения(Объект);
	Если Занято <> "" Тогда
		Возврат Новый Структура("Успех, Текст", Ложь,
			СтрШаблон(НСтр("ru = 'Урок %1 не перенесён: %2'"), Перенос.Урок, Занято));
	КонецЕсли;
	Итог = УЗ_Общий.ЗаписатьУрок(Объект, Объект.Проведен);
	Если Не Итог.Успех Тогда
		Возврат Новый Структура("Успех, Текст", Ложь,
			СтрШаблон(НСтр("ru = 'Урок %1 не перенесён: %2'"), Перенос.Урок, Итог.Текст));
	КонецЕсли;
	Текст = "";
	Если Итог.Пометка <> "" Тогда
		Текст = СтрШаблон(НСтр("ru = 'Урок %1 перенесён и %2'"), Перенос.Урок, Итог.Пометка);
	КонецЕсли;
	Возврат Новый Структура("Успех, Текст", Истина, Текст);

КонецФункции

//Значения нового урока из календаря: время, помещение и отбор (группа — её педагог со ставкой, предмет, тариф;
//или педагог со своей ставкой). Форма урока открывается сразу заполненным черновиком, без вопроса.
Функция ЗначенияНовогоУрока(Начало, Конец, Помещение, ГруппаОбучения, Педагог) Экспорт

	Значения = Новый Структура;
	Значения.Вставить("Дата", Начало);
	Значения.Вставить("КоличествоЧасов", (Конец - Начало) / 3600);
	Если ЗначениеЗаполнено(Помещение) Тогда
		Значения.Вставить("Помещение", Помещение);
	КонецЕсли;
	Если ЗначениеЗаполнено(ГруппаОбучения) Тогда
		Значения.Вставить("ГруппаОбучения", ГруппаОбучения);
		Значения.Вставить("Педагог", ГруппаОбучения.Педагог);
		Значения.Вставить("СтавкаПедагога",
			Документы.УЗ_Урок.СтавкаПедагогаПоУмолчанию(ГруппаОбучения.Педагог, ГруппаОбучения));
		Значения.Вставить("ПредметОбучения", ГруппаОбучения.ПредметОбучения);
		Если ЗначениеЗаполнено(ГруппаОбучения.Тариф) Тогда
			Значения.Вставить("Тариф", ГруппаОбучения.Тариф);
		КонецЕсли;
	ИначеЕсли ЗначениеЗаполнено(Педагог) Тогда
		Значения.Вставить("Педагог", Педагог);
		Значения.Вставить("СтавкаПедагога", Педагог.СтавкаПедагога);
	КонецЕсли;
	Возврат Значения;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьОтбор(Запрос, Имя, Отборы, Пустое)

	Значение = Неопределено;
	Если Не Отборы.Свойство(Имя, Значение) Или Не ЗначениеЗаполнено(Значение) Тогда
		Значение = Пустое;
	КонецЕсли;
	Запрос.УстановитьПараметр(Имя, Значение);
	Запрос.УстановитьПараметр("Без" + Имя, Не ЗначениеЗаполнено(Значение));

КонецПроцедуры

Функция ЗначениеПоказа(Показ, Имя, ПоУмолчанию)

	Значение = Неопределено;
	Если Показ.Свойство(Имя, Значение) И Значение <> Неопределено Тогда
		Возврат Значение;
	КонецЕсли;
	Возврат ПоУмолчанию;

КонецФункции

Функция ПредставлениеИнтервала(Начало, Конец)

	Если НачалоДня(Начало) = НачалоДня(Конец) Тогда
		Возврат Формат(Начало, "ДФ='дд.ММ ЧЧ:мм'") + "–" + Формат(Конец, "ДФ=ЧЧ:мм");
	КонецЕсли;
	Возврат Формат(Начало, "ДФ='дд.ММ ЧЧ:мм'") + "–" + Формат(Конец, "ДФ='дд.ММ ЧЧ:мм'");

КонецФункции

#КонецОбласти

#КонецЕсли
